app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def index
    @tasks = Task.all

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @task = Task.find(params[:id])