app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics"
---
  def index
    @topics = Topic.all

INSERT INTO "topics" ("topic", "created_at", "updated_at") VALUES (?, ?, ?)  [["topic", "hello"], ["created_at", "2015-06-05 20:47:11.292290"], ["updated_at", "2015-06-05 20:47:11.292290"]]
---
  def create
    @topic = Topic.create(topic_params)

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 6]]
---
  def show
    @topic = Topic.find(params[:id])